Repository: stefc6/turni_lav
Catalog: lib/l10n/app_*.arb
Languages: es, fr, it

# app_title
source: Work Shifts
es: Turnos de Trabajo
fr: Horaires de Travail
it: Turni Lavoro

source: Calendar
es: Calendario
fr: Calendrier
it: Calendario

source: Summary
es: Resumen
fr: Résumé
it: Riepilogo

source: Settings
es: Configuración
fr: Paramètres
it: Impostazioni

# info
source: Information
es: Información
fr: Informations
it: Informazioni

source: Menu
es: Menú
it: Menù

source: Save
es: Guardar
fr: Enregistrer
it: Salva

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla

source: Confirm
es: Confirmar
fr: Confirmer
it: Conferma

source: Reset
es: Restablecer
fr: Réinitialiser
it: Ripristina

source: Reset Calendar
es: Restablecer Calendario
fr: Réinitialiser le Calendrier
it: Ripristina Calendario

source: Reset Summary
es: Restablecer Resumen
fr: Réinitialiser le Résumé
it: Ripristina Riepilogo

source: Reset Custom Shifts
es: Restablecer Turnos Pers.
fr: Réinitialiser les Horaires Pers.
it: Ripristina Turni Pers.

source: Reset App
es: Restablecer App
fr: Réinitialiser l'App
it: Ripristina App

source: Close
es: Cerrar
fr: Fermer
it: Chiudi

source: Add
es: Añadir
fr: Ajouter
it: Aggiungi

source: Edit
es: Editar
fr: Modifier
it: Modifica

source: Delete
es: Eliminar
fr: Supprimer
it: Elimina

source: Backup
es: Copia de seguridad
fr: Sauvegarde

source: Restore
es: Restaurar
fr: Restaurer
it: Ripristina

source: Contacts:
es: Contactos:
it: Contatti:

source: Debug Mode
es: Modo Depuración
fr: Mode Débogage

source: Theme
es: Tema
fr: Thème
it: Tema

source: System
es: Sistema
fr: Système
it: Sistema

source: Light
es: Claro
fr: Clair
it: Chiaro

source: Dark
es: Oscuro
fr: Sombre
it: Scuro

source: Customize shifts
es: Personalizar turnos
fr: Personnaliser les horaires
it: Personalizza turni

source: Shift hours
es: Horas del turno
fr: Heures du poste
it: Ore del turno

# select_duration
source: Select shift duration
es: Seleccionar duración del turno
fr: Sélectionner la durée du poste
it: Seleziona durata turno

# exit_confirmation
source: Confirm exit
es: Confirmar salida
fr: Confirmer la sortie
it: Conferma uscita

# do_you_want_to_exit
source: Do you really want to exit the app?
es: ¿Realmente quieres salir de la app?
fr: Voulez-vous vraiment quitter l'application ?
it: Vuoi davvero uscire dall'app?

source: Yes
es: Sí
fr: Oui
it: Sì

# select_month_year
source: Select month and year
es: Seleccionar mes y año
fr: Sélectionner le mois et l'année
it: Seleziona mese e anno

source: Select Year
es: Seleccionar Año
fr: Sélectionner l'année
it: Seleziona Anno

source: Select shift
es: Seleccionar turno
fr: Sélectionner le poste
it: Seleziona turno

# no_custom_shifts
source: No saved shifts. You can add them from the Settings screen.
es: No hay turnos guardados. Puedes añadirlos desde la pantalla de Configuración.
fr: Aucun poste enregistré. Vous pouvez les ajouter depuis l'écran Paramètres.
it: Nessun turno salvato. Puoi aggiungerli dalla schermata Impostazioni.

# no_custom_shifts_short
source: No custom shifts
es: No hay turnos personalizados
fr: Aucun poste personnalisé
it: Nessun turno personalizzato

source: Add shift
es: Añadir turno
fr: Ajouter un poste
it: Aggiungi turno

source: Edit shift
es: Editar turno
fr: Modifier le poste
it: Modifica turno

# delete_shift_confirm
source: Are you sure you want to delete the shift "{shift}"? This action cannot be undone.
es: ¿Seguro que quieres eliminar el turno "{shift}"? Esta acción no se puede deshacer.
fr: Êtes-vous sûr de vouloir supprimer le poste "{shift}" ? Cette action est irréversible.
it: Sei sicuro di voler eliminare il turno "{shift}"? Questa azione non può essere annullata.

source: Shift name
es: Nombre del turno
fr: Nom du poste
it: Nome turno

# shift_name_required
source: Name required
es: Nombre obligatorio
fr: Nom obligatoire
it: Nome obbligatorio

source: Start
es: Inicio
fr: Début
it: Inizio

source: End
es: Fin
fr: Fin
it: Fine

# duration
source: Duration (hh:mm)
es: Duración (hh:mm)
fr: Durée (hh:mm)
it: Durata (hh:mm)

source: Initial place
es: Lugar inicial
fr: Lieu initial
it: Luogo iniziale

source: Final place
es: Lugar final
fr: Lieu final
it: Luogo finale

source: Shift tag
es: Etiqueta del turno
fr: Tag du poste
it: Tag del turno

# save_shift
source: Save
es: Guardar
fr: Enregistrer
it: Salva

# cancel_shift
source: Cancel
es: Cancelar
fr: Annuler
it: Annulla

# delete_shift
source: Delete
es: Eliminar turno
fr: Supprimer le poste
it: Elimina

# edit_duration
source: Edit shift duration
es: Editar duración del turno
fr: Modifier la durée du poste
it: Modifica durata turno

source: Edit overtime
es: Editar horas extra
fr: Modifier les heures supplémentaires
it: Modifica straordinario

source: Overtime
es: Horas extra
fr: Heures supplémentaires
it: Straordinario

# overtime_gross
source: Overtime (gross without breaks)
es: Horas extra (bruto sin pausas)
fr: Heures supplémentaires (brut sans pauses)
it: Straordinario (lordo senza pause)

# overtime_net
source: Overtime (net of breaks)
es: Horas extra (neto de pausas)
fr: Heures supplémentaires (net des pauses)
it: Straordinario (netto delle pause)

# no_breaks
source: No breaks recorded
es: No hay pausas registradas
fr: Aucune pause enregistrée
it: Nessuna pausa registrata

# breaks
source: Unpaid breaks
es: Pausas no remuneradas
fr: Pauses non rémunérées
it: Pause non retribuite

# breaks_total
source: Total breaks
es: Total de pausas
fr: Total des pauses
it: Totale pause

# breaks_edit
source: Edit break
es: Editar pausa
fr: Modifier la pause
it: Modifica pausa

# breaks_duration
source: Duration
es: Duración
fr: Durée
it: Durata

source: Add break
es: Añadir pausa
fr: Ajouter une pause
it: Aggiungi pausa

source: Delete break
es: Eliminar pausa
fr: Supprimer la pause
it: Elimina pausa

# delete_break_confirm
source: Are you sure you want to delete this break?
es: ¿Seguro que quieres eliminar esta pausa?
fr: Êtes-vous sûr de vouloir supprimer cette pause ?
it: Sei sicuro di voler eliminare questa pausa?

# notes
source: Additional notes
es: Notas adicionales
fr: Notes supplémentaires
it: Note aggiuntive

source: Clear notes
es: Borrar notas
fr: Effacer les notes
it: Cancella note

# select_number
source: Select a number
es: Seleccionar un número
fr: Sélectionner un nombre
it: Seleziona un numero

source: Shift
es: Turno
fr: Poste
it: Turno

source: Select
es: Seleccionar
fr: Sélectionner
it: Seleziona

source: Effective shift
es: Turno efectivo
fr: Poste effectif
it: Effettivo del turno

source: Schedule
es: Horario
fr: Horaire
it: Orario

source: Place
es: Lugar
fr: Lieu
it: Luogo

# notes_short
source: Notes
es: Notas
it: Note

# delete_day_confirm
source: Are you sure you want to delete the data for the day {date}?
es: ¿Seguro que quieres eliminar los datos del día {date}?
fr: Êtes-vous sûr de vouloir supprimer les données du jour {date} ?
it: Sei sicuro di voler eliminare i dati per la giornata {date}?

# add_day
source: Add
es: Añadir
fr: Ajouter
it: Aggiungi

# no_day_data
source: No data found for this day, you can add some by pressing the Add button.
es: No se encontraron datos para este día, puedes añadirlos presionando el botón Añadir.
fr: Aucune donnée trouvée pour ce jour, vous pouvez en ajouter en appuyant sur le bouton Ajouter.
it: Nessun dato trovato per questa giornata, puoi aggiungerne premendo il tasto Aggiungi.

# holidays_available
source: Available Holidays
es: Vacaciones disponibles
fr: Congés disponibles
it: Ferie Disponibili

source: Holidays Left
es: Vacaciones restantes
fr: Congés restants
it: Ferie Rimaste

source: Holidays Taken
es: Vacaciones tomadas
fr: Congés pris
it: Ferie Usufruite

# rest
source: Days Off
es: Descansos
fr: Repos
it: Riposi

# missed_performance
source: Missed Performances
es: Rendimientos perdidos
fr: Prestations manquées
it: Mancate Prestazioni

source: Suppressed Holidays
es: Festivos suprimidos
fr: Jours fériés supprimés
it: Festività Sopresse

source: Work Suspension
es: Suspensión laboral
fr: Suspension du travail
it: Sospensione Lavorativa

source: Accessory Times
es: Tiempos accesorios
fr: Temps accessoires
it: Tempi Accessori

source: Paid Leave
es: Permiso retribuido
fr: Congé payé
it: Permesso Retribuito

source: Midweek Holidays
es: Festivos entre semana
fr: Jours fériés en semaine
it: Festività Infrasettimanali

# illness
source: Sickness
es: Enfermedad
fr: Maladie
it: Malattia

source: Law 104
es: Ley 104
fr: Loi 104

source: Parental Leave
es: Permiso parental
fr: Congé parental
it: Congedo Parentale

# missed_performance_adequacy
source: Missed Performance Adjustments
es: Ajustes de rendimiento perdido
fr: Ajustements prestations manquées
it: Mancate Prestazioni di Adeguamento

# holidays_available_plus_prev
source: Available Holidays: (+FR previous year)
es: Vacaciones disponibles:
fr: Congés disponibles :
it: Ferie Disponibili: (+FR anno precedente)

# holidays_left_label
source: Holidays Left:
es: Vacaciones restantes:
fr: Congés restants :
it: Ferie Rimaste:

# holidays_taken_label
source: Holidays Taken:
es: Vacaciones tomadas:
fr: Congés pris :
it: Ferie Usufruite:

# rest_label
source: Days Off:
es: Descansos:
fr: Repos :
it: Riposi:

# missed_performance_label
source: Missed Performances:
es: Rendimientos perdidos:
fr: Prestations manquées :
it: Mancate Prestazioni:

# suppressed_holidays_label
source: Suppressed Holidays:
es: Festivos suprimidos:
fr: Jours fériés supprimés :
it: Festività Sopresse:

# work_suspension_label
source: Work Suspension:
es: Suspensión laboral:
fr: Suspension du travail :
it: Sospensione Lavorativa:

# accessory_times_label
source: Accessory Times:
es: Tiempos accesorios:
fr: Temps accessoires :
it: Tempi Accessori:

# paid_leave_label
source: Paid Leave:
es: Permiso retribuido:
fr: Congé payé :
it: Permesso Retribuito:

# midweek_holidays_label
source: Midweek Holidays:
es: Festivos entre semana:
fr: Jours fériés en semaine :
it: Festività Infrasettimanali:

# illness_label
source: Sickness:
es: Enfermedad:
fr: Maladie :
it: Malattia:

# law_104_label
source: Law 104:
es: Ley 104:
fr: Loi 104 :

# parental_leave_label
source: Parental Leave:
es: Permiso parental:
fr: Congé parental :
it: Congedo Parentale:

# missed_performance_adequacy_label
source: Missed Performance Adjustments:
es: Ajustes de rendimiento perdido:
fr: Ajustements prestations manquées :
it: Mancate Prestazioni di Adeguamento:

# backup_exported
source: Backup exported to {path}
es: Copia exportada a {path}
fr: Sauvegarde exportée vers {path}
it: Backup esportato in {path}

# backup_imported
source: Backup imported successfully!
es: ¡Copia importada con éxito!
fr: Sauvegarde importée avec succès !
it: Backup importato con successo!

# backup_export_error
source: Error during export: {error}
es: Error durante la exportación: {error}
fr: Erreur lors de l'exportation : {error}
it: Errore durante l'esportazione: {error}

# backup_import_error
source: Error during import: {error}
es: Error durante la importación: {error}
fr: Erreur lors de l'importation : {error}
it: Errore durante l'importazione: {error}

# reset_visibility_confirm
source: Do you want to restore the default visibility of the summary items?
es: ¿Quieres restablecer la visibilidad predeterminada de los elementos del resumen y reiniciar todas las vacaciones disponibles y ajustes de rendimiento perdido para todos los años?
fr: Voulez-vous réinitialiser la visibilité par défaut des éléments du résumé et remettre à zéro tous les congés disponibles et ajustements de prestations manquées pour toutes les années ?
it: Vuoi ripristinare la visibilità predefinita degli elementi del riepilogo?

# reset_calendar_confirm
source: Are you sure you want to delete all daily shift data?
es: ¿Seguro que quieres eliminar todos los datos de turnos por día?
fr: Êtes-vous sûr de vouloir supprimer toutes les données des postes par jour ?
it: Sei sicuro di voler cancellare tutti i dati dei turni per giornata?

# reset_summary_confirm
source: Do you want to restore the default visibility of summary items and reset all available holidays and missed performance adjustments for all years?
es: ¿Quieres restablecer la visibilidad predeterminada de los elementos del resumen y reiniciar todas las vacaciones disponibles y ajustes de rendimiento perdido para todos los años?
fr: Voulez-vous réinitialiser la visibilité par défaut des éléments du résumé et remettre à zéro tous les congés disponibles et ajustements de prestations manquées pour toutes les années ?
it: Vuoi ripristinare la visibilità predefinita degli elementi del riepilogo e azzerare tutte le ferie disponibili e le manc. prest. di adeguamento per tutti gli anni?

# reset_custom_shifts_confirm
source: Are you sure you want to delete all custom shift data?
es: ¿Seguro que quieres eliminar todos los datos de turnos personalizados?
fr: Êtes-vous sûr de vouloir supprimer toutes les données des postes personnalisés ?
it: Sei sicuro di voler cancellare tutti i dati dei turni personalizzati?

# reset_app_confirm
source: Are you sure you want to delete all data and restart the app?
es: ¿Seguro que quieres eliminar todos los datos de la app?
fr: Êtes-vous sûr de vouloir supprimer toutes les données de l'application ?
it: Sei sicuro di voler cancellare tutti i dati e riavviare l'app?

# reset_visibility_done
source: Summary visibility settings restored.
es: Configuración de visibilidad del resumen restablecida.
fr: Paramètres de visibilité du résumé réinitialisés.
it: Impostazioni di visibilità del riepilogo ripristinate.

# reset_calendar_done
source: All daily shift data has been deleted.
es: Todos los datos de turnos por día han sido eliminados.
fr: Toutes les données des postes par jour ont été supprimées.
it: Tutti i dati dei turni per giornata sono stati cancellati.

# reset_summary_done
source: Visibility settings and annual summary values restored.
es: Configuración de visibilidad y valores anuales del resumen restablecidos.
fr: Paramètres de visibilité et valeurs annuelles du résumé réinitialisés.
it: Impostazioni di visibilità e valori annuali del riepilogo ripristinati.

# reset_custom_shifts_done
source: All custom shift data has been deleted.
es: Todos los datos de turnos personalizados han sido eliminados.
fr: Toutes les données des postes personnalisés ont été supprimées.
it: Tutti i dati dei turni personalizzati sono stati cancellati.

# reset_app_done
source: All data has been deleted. The app will restart.
es: Todos los datos han sido eliminados.
fr: Toutes les données ont été supprimées.
it: Tutti i dati sono stati cancellati. L'app verrà riavviata.

source: Data saved
es: Datos guardados
fr: Données enregistrées
it: Dati salvati

source: No breaks entered
es: No se han introducido pausas
fr: Aucune pause saisie
it: Nessuna pausa inserita

source: No custom shifts found
es: No hay turnos personalizados
fr: Aucun poste personnalisé
it: Nessun turno personalizzato

# no_day_found
source: No data found for this day
es: No se encontraron datos para este día
fr: Aucune donnée trouvée pour ce jour
it: Nessun dato trovato per questa giornata

source: Select month
es: Seleccionar mes
fr: Sélectionner le mois
it: Seleziona mese

# select_year_label
source: Select year
es: Seleccionar año
fr: Sélectionner l'année
it: Seleziona anno

# select_shift_label
source: Select shift
es: Seleccionar turno
fr: Sélectionner le poste
it: Seleziona turno

# edit_shift_label
source: Edit shift
es: Editar turno
fr: Modifier le poste
it: Modifica turno

# delete_shift_label
source: Delete shift
es: Eliminar turno
fr: Supprimer le poste
it: Elimina turno

# add_shift_label
source: Add shift
es: Añadir turno
fr: Ajouter le poste
it: Aggiungi turno

# edit_break_label
source: Edit break
es: Editar pausa
fr: Modifier la pause
it: Modifica pausa

# delete_break_label
source: Delete break
es: Eliminar pausa
fr: Supprimer la pause
it: Elimina pausa

# add_break_label
source: Add break
es: Añadir pausa
fr: Ajouter la pause
it: Aggiungi pausa

# edit_notes_label
source: Edit notes
es: Editar notas
fr: Modifier les notes
it: Modifica note

# clear_notes_label
source: Clear notes
es: Borrar notas
fr: Effacer les notes
it: Cancella note

source: No
fr: Non
